# How to Read Data Using Pandas

## Reding Files Using Pandas

In [46]:
import pandas as pd

from IPython.display import display

In [47]:
csv_data = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/shopping_data.csv")
# csv_data.to_csv(r"D:\Usep Syaikal Arifin\Computer Programming\Python\DQLab-Academy-Course-Online\Kelas Fundamental 2\Data Wrangling Python\File Dokumentasi\File CSV\shopping_data.csv", index=None, header=True)
# csv_data.to_excel(r"D:\Usep Syaikal Arifin\Computer Programming\Python\DQLab-Academy-Course-Online\Kelas Fundamental 2\Data Wrangling Python\File Dokumentasi\File Excel\shopping_data.xlsx", index=None, header=True)

display(csv_data.head())

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

## Reading Files Using Methods head()

In [48]:
display(csv_data.head())

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

## Access Columns Data

In [49]:
display(csv_data[["Age"]].head(10))

   Age
0   19
1   21
2   20
3   23
4   31
5   22
6   35
7   23
8   64
9   30

## Access Data Via Row

In [50]:
display(csv_data.iloc[5])

CustomerID                     6
Genre                     Female
Age                           22
Annual Income (k$)            17
Spending Score (1-100)        76
Name: 5, dtype: object

## Displays Certain Data from Rows and Columns

In [51]:
display(csv_data["Age"].iloc[1])
print("Cuplikan Dataset : ?")
display(csv_data.head())

21

Cuplikan Dataset : ?

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

## Display a Data within Certain Range

In [52]:
print("Menampilkan data ke 5 sampai kurang dari 10 dalam satu baris : ")
display(csv_data.iloc[5:10])

Menampilkan data ke 5 sampai kurang dari 10 dalam satu baris :

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
5           6  Female   22                  17                      76
6           7  Female   35                  18                       6
7           8  Female   23                  18                      94
8           9    Male   64                  19                       3
9          10  Female   30                  19                      72

## Displaying Statistical Information with Numpy

In [53]:
display(csv_data.describe(exclude=["O"]))

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

# Handling Missing Values

## Checks for Existing NULL Values

In [54]:
display(csv_data.isnull().any())

CustomerID                False
Genre                     False
Age                       False
Annual Income (k$)        False
Spending Score (1-100)    False
dtype: bool

## Imputation Missing Value with Mean

In [55]:
csv_data = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/shopping_data_missingvalue.csv")
# csv_data.to_csv(r"D:\Usep Syaikal Arifin\Computer Programming\Python\DQLab-Academy-Course-Online\Kelas Fundamental 2\Data Wrangling Python\File Dokumentasi\File CSV\shopping_data_missingvalue.csv", index=None, header=True)
# csv_data.to_excel(r"D:\Usep Syaikal Arifin\Computer Programming\Python\DQLab-Academy-Course-Online\Kelas Fundamental 2\Data Wrangling Python\File Dokumentasi\File Excel\shopping_data_missingvalue.xlsx", index=None, header=True)
print("Checks for Existing Missing Value = ?")
display(csv_data.isnull().sum())
print("Check the Value of Basic Statistics = ?")
display(csv_data.describe())
display(csv_data.head())

Checks for Existing Missing Value = ?

CustomerID                0
Genre                     0
Age                       1
Annual Income (k$)        2
Spending Score (1-100)    2
dtype: int64

Check the Value of Basic Statistics = ?

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  199.000000          198.000000              198.000000
mean   100.500000   38.939698           61.005051               50.489899
std     57.879185   13.946376           26.017857               25.723587
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   29.000000           42.250000               35.000000
50%    100.500000   36.000000           62.000000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

   CustomerID   Genre   Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male  19.0                15.0                    39.0
1           2    Male   NaN                15.0                    81.0
2           3  Female  20.0                 NaN                     6.0
3           4  Female  23.0                16.0                    77.0
4           5  Female  31.0                17.0                     NaN

In [56]:
missing_value_columns = csv_data.columns[csv_data.isnull().any()].to_list()
display(missing_value_columns)

['Age', 'Annual Income (k$)', 'Spending Score (1-100)']

In [57]:
csv_data_mean = csv_data.copy()
csv_data_mean = csv_data_mean.fillna(csv_data_mean[missing_value_columns].mean())

In [58]:
print("Checks for Existing Missing Value = ?")
display(csv_data_mean.isnull().sum())

Checks for Existing Missing Value = ?

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [59]:
display(csv_data_mean.head(10))

   CustomerID   Genre        Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male  19.000000           15.000000               39.000000
1           2    Male  38.939698           15.000000               81.000000
2           3  Female  20.000000           61.005051                6.000000
3           4  Female  23.000000           16.000000               77.000000
4           5  Female  31.000000           17.000000               50.489899
5           6  Female  22.000000           61.005051               76.000000
6           7  Female  35.000000           18.000000                6.000000
7           8  Female  23.000000           18.000000               94.000000
8           9    Male  64.000000           19.000000               50.489899
9          10  Female  30.000000           19.000000               72.000000

## Imputation of Missing Value with Median

In [60]:
csv_data_median = csv_data.copy()

print("Check for Existing Missing Value = ? ")
display(csv_data_median.isnull().sum())
display(csv_data_median.head())

Check for Existing Missing Value = ?

CustomerID                0
Genre                     0
Age                       1
Annual Income (k$)        2
Spending Score (1-100)    2
dtype: int64

   CustomerID   Genre   Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male  19.0                15.0                    39.0
1           2    Male   NaN                15.0                    81.0
2           3  Female  20.0                 NaN                     6.0
3           4  Female  23.0                16.0                    77.0
4           5  Female  31.0                17.0                     NaN

In [61]:
csv_data_median = csv_data_median.fillna(csv_data_median[missing_value_columns].median())
print("Check for Existing Missing Value = ?")
display(csv_data_median.isnull().sum())

Check for Existing Missing Value = ?

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

# Data Normalization

## Data Normalization Practice Using Scikit-Learn in Python

In [62]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import MinMaxScaler

In [63]:
csv_data = pd.read_csv("https://storage.googleapis.com/dqlab-dataset/shopping_data.csv")

print("Dimension of Dataset = %d Baris & %d Kolom"%csv_data.shape)
print("Checking Dataset Information = ?")
display(csv_data.info())
print("Check for Existing Missing Value = ?")
display(csv_data.isnull().sum())

Dimension of Dataset = 200 Baris & 5 Kolom
Checking Dataset Information = ?
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Genre                   200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

None

Check for Existing Missing Value = ?

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [64]:
display(csv_data.head(10))

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40
5           6  Female   22                  17                      76
6           7  Female   35                  18                       6
7           8  Female   23                  18                      94
8           9    Male   64                  19                       3
9          10  Female   30                  19                      72

### Data Normalization with MinMaxScaler

In [65]:
dataset = csv_data.copy()

In [66]:
scaler_columns = ["Age","Annual Income (k$)","Spending Score (1-100)"]
scaler = MinMaxScaler()
dataset[scaler_columns] = scaler.fit_transform(dataset[scaler_columns])

In [67]:
print("Checking The Value of Basic Statistics = ?")
display(dataset.describe())

Checking The Value of Basic Statistics = ?

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000    0.400962            0.373443                0.502041
std     57.879185    0.268635            0.215285                0.263505
min      1.000000    0.000000            0.000000                0.000000
25%     50.750000    0.206731            0.217213                0.344388
50%    100.500000    0.346154            0.381148                0.500000
75%    150.250000    0.596154            0.516393                0.734694
max    200.000000    1.000000            1.000000                1.000000